app/controllers/authors_controller.rb

  def index
    @authors = Author.all
---
SELECT * FROM "authors"

  def show
    @author = Author.find(params[:id])
---
SELECT * FROM "authors" WHERE ("authors"."id" = 8)

  def edit
    @author = Author.find(params[:id])
---
SELECT * FROM "authors" WHERE ("authors"."id" = 4)

  def create
    @author = Author.new(params[:id])

    respond_to do |format|
      if @author.save
---
INSERT INTO "authors" ("author_last_name", "created_at", "updated_at", "website", "author_first_name", "author_id", "book_id", "itunes") VALUES(NULL, '2010-02-14 03:37:12', '2010-02-14 03:37:12', NULL, NULL, NULL, NULL, NULL)

  def update
    @author = Author.find(params[:id])

    respond_to do |format|
      if @author.update_attributes(params[:author])
---
SELECT * FROM "authors" WHERE ("authors"."id" = 5)
UPDATE "authors" SET "updated_at" = '2010-03-18 01:20:36', "author_first_name" = 'Derek 2' WHERE "id" = 4