app/controllers/bookcharacters_controller.rb

SELECT * FROM "bookcharacters"
---
  def index
    @bookcharacters = Bookcharacter.all

SELECT * FROM "bookcharacters" WHERE ("bookcharacters"."id" = 8)
---
  def show
    @bookcharacter = Bookcharacter.find(params[:id])

INSERT INTO "bookcharacters" ("created_at", "animal_category", "updated_at", "animal_type", "book_id") VALUES('2010-03-01 19:39:31', NULL, '2010-03-01 19:39:31', NULL, NULL)
---
  def create
    @bookcharacter = Bookcharacter.new(params[:bookcharacter])

    respond_to do |format|
      if @bookcharacter.save