app/controllers/books_controller.rb

  def index
    @books = Book.all
---
SELECT * FROM "books" LIMIT 1

  def edit
    @book = Book.find(params[:id])
---
SELECT * FROM "books" WHERE ("books"."id" = 1)

  def create
    @book = Book.new(params[:book])

    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("author_last_name", "price", "created_at", "title", "isbn", "animal_category", "updated_at", "amazon_id", "cover_picture", "itunes_url", "user_id", "author_first_name", "animal_type", "description", "book_id", "author_id", "author_website", "amazon_url") VALUES('Pot', NULL, '2010-03-18 18:33:57', 'pot pie 4', 456, NULL, '2010-03-18 18:33:57', NULL, NULL, NULL, NULL, 'Pie', NULL, NULL, 456, 456, NULL, NULL)

  def destroy
    @book = Book.find(params[:id])
    @book.destroy
---
SELECT * FROM "books" WHERE ("books"."id" = 16)
DELETE FROM "books" WHERE "id" = 16