app/controllers/sessions_controller.rb

  def create
    @current_user = User.find_by_login_and_password(
      params[:login], params[:password])
---
SELECT * FROM "users" WHERE ("users"."login" = 'green flea' AND "users"."password" = 'green') LIMIT 1