app/controllers/users_controller.rb

SELECT * FROM "users" ORDER BY login
---
  def index
    @users = User.all

INSERT INTO "users" ("created_at", "updated_at", "login", "password", "email") VALUES('2010-02-23 16:39:24', '2010-02-23 16:39:24', 'Katrinas', 'enemypie', 'klittle@edaya.com')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save != nil

SELECT * FROM "users" WHERE ("users"."id" = 19) LIMIT 1
UPDATE "users" SET "updated_at" = '2010-02-23 16:57:20', "email" = 'georgeroc@yahoo.com', "login" = 'george roc' WHERE "id" = 4
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])